# 元组（不可变）tuple()
# t = (1, 1.2, 'abc', [4, 5, 6], {'a': 1, 'b': 2}, (7, 8, 9),)
# print(type(t))
# a = (88,)
# print(type(a))

# x = (36, 'd', 1.68, ['a', 'b', 'c'])
# 0:值36的内存地址    ——>36
# 1：值'd'的内存地址   ——>'d'
# 2：值1.68的内存地址  ——>1.68
# x[1] = 'e'
# print(id(x[3]))
# x[3][0] = 'd'
# print(id(x[3]))
# print(x)


# 类型转换
# print(tuple('张大仙'))
# print(tuple([1, 2, 3]))
# print(tuple({'a': 1, 'b': 2}))
# print(tuple(range(5)))

# 元组的内置方法
msg = ('木', '火', '土', '金', '水',)
# msg.

# 索引取值
# 切片
# 统计长度
# 成员运算
# 循环
